/*
 * @Author: yangxuefeng yangxuefeng@clinbrain.com
 * @Description: 数组压缩
 */
/* ================== zip ================== */
// 创建一个分组元素数组，其中第一个包含给定数组的第一个元素，第二个包含给定数组的第二个元素，依此类推。

/* ================== zipObject ================== */
// 此方法与此方法类似_.fromPairs，只是它接受两个数组，一个是属性标识符，一个是相应的值。

{
  _.zipObject(["a", "b"], [1, 2]);
  // => { 'a': 1, 'b': 2 }
}

/* ================== zipObjectDeep ================== */
// 此方法与此方法类似，_.zipObject只是它支持属性路径。
{
  _.zipObjectDeep(["a.b[0].c", "a.b[1].d"], [1, 2]);
  // => { 'a': { 'b': [{ 'c': 1 }, { 'd': 2 }] } }
}
/* ================== zipWith ================== */
// 此方法与此方法类似，_.zip只是它接受iteratee指定如何组合分组值。使用每个组的元素调用 iteratee：(...group)。
{
  _.zipWith([1, 2], [10, 20], [100, 200], function (a, b, c) {
    return a + b + c;
  });
  // => [111, 222]
}
